_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 109, 89, 20)       11900     
_________________________________________________________________
activation_1 (Activation)    (None, 109, 89, 20)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 44, 20)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 54, 44, 50)        36050     
_________________________________________________________________
activation_2 (Activation)    (None, 54, 44, 50)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 27, 22, 50)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 22, 80)        24080     
_________________________________________________________________
activation_3 (Activation)    (None, 27, 22, 80)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 11, 80)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 11440)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 2860)              32721260  
_________________________________________________________________
activation_4 (Activation)    (None, 2860)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2860)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 5722      
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 32,799,012
Trainable params: 32,799,012
Non-trainable params: 0
_________________________________________________________________
