_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 109, 89, 30)       2280      
_________________________________________________________________
activation_1 (Activation)    (None, 109, 89, 30)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 44, 30)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 54, 44, 40)        19240     
_________________________________________________________________
activation_2 (Activation)    (None, 54, 44, 40)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 27, 22, 40)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 22, 60)        14460     
_________________________________________________________________
activation_3 (Activation)    (None, 27, 22, 60)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 11, 60)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8580)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              35147776  
_________________________________________________________________
activation_4 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 8194      
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 35,191,950
Trainable params: 35,191,950
Non-trainable params: 0
_________________________________________________________________
