_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 109, 89, 10)       3970      
_________________________________________________________________
activation_1 (Activation)    (None, 109, 89, 10)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 44, 10)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 54, 44, 20)        2420      
_________________________________________________________________
activation_2 (Activation)    (None, 54, 44, 20)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 27, 22, 20)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 22, 40)        4840      
_________________________________________________________________
activation_3 (Activation)    (None, 27, 22, 40)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 11, 40)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5720)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              11716608  
_________________________________________________________________
activation_4 (Activation)    (None, 2048)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 4098      
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 11,731,936
Trainable params: 11,731,936
Non-trainable params: 0
_________________________________________________________________
