_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 109, 89, 30)       840       
_________________________________________________________________
activation_1 (Activation)    (None, 109, 89, 30)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 44, 30)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 54, 44, 60)        16260     
_________________________________________________________________
activation_2 (Activation)    (None, 54, 44, 60)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 27, 22, 60)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 22, 100)       36100     
_________________________________________________________________
activation_3 (Activation)    (None, 27, 22, 100)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 11, 100)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14300)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 8192)              117153792 
_________________________________________________________________
activation_4 (Activation)    (None, 8192)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 8192)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 16386     
_________________________________________________________________
activation_5 (Activation)    (None, 2)                 0         
=================================================================
Total params: 117,223,378
Trainable params: 117,223,378
Non-trainable params: 0
_________________________________________________________________
